reports/benchmark/inspur_MetaX_C550/GLM-5-W8A8/test_03/01/32-1000-i90000-o2000/bench-test_03-32-1000-i90000-o2000.log
Skipping import of cpp extensions due to incompatible torch version 2.8.0+metax3.5.3.9 for torchao version 0.15.0             Please see https://github.com/pytorch/ao/issues/2919 for more info
/opt/conda/lib/python3.10/site-packages/torchvision/datapoints/__init__.py:12: UserWarning: The torchvision.datapoints and torchvision.transforms.v2 namespaces are still Beta. While we do not expect major breaking changes, some APIs may still change according to user feedback. Please submit any feedback you may have in this issue: https://github.com/pytorch/vision/issues/6753, and you can also check out https://github.com/pytorch/vision/issues/7319 to learn more about the APIs that we suspect might involve future changes. You can silence this warning by calling torchvision.disable_beta_transforms_warning().
  warnings.warn(_BETA_TRANSFORMS_WARNING)
/opt/conda/lib/python3.10/site-packages/torchvision/transforms/v2/__init__.py:54: UserWarning: The torchvision.datapoints and torchvision.transforms.v2 namespaces are still Beta. While we do not expect major breaking changes, some APIs may still change according to user feedback. Please submit any feedback you may have in this issue: https://github.com/pytorch/vision/issues/6753, and you can also check out https://github.com/pytorch/vision/issues/7319 to learn more about the APIs that we suspect might involve future changes. You can silence this warning by calling torchvision.disable_beta_transforms_warning().
  warnings.warn(_BETA_TRANSFORMS_WARNING)
benchmark_args=Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=8000, dataset_name='random', dataset_path='/home/workspace/ShareGPT_V3_unfiltered_cleaned_split.json', model='/var_docker/data_shared/GLM-5-W8A8', served_model_name=None, tokenizer=None, num_prompts=1000, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=90000, random_output_len=2000, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file='reports/benchmark/inspur_MetaX_C550/GLM-5-W8A8/test_03/01/32-1000-i90000-o2000/bench-test_03-32-1000-i90000-o2000.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None, rampup_mode=False, ramp_up_period=0.0)
Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=8000, dataset_name='random', dataset_path='/home/workspace/ShareGPT_V3_unfiltered_cleaned_split.json', model='/var_docker/data_shared/GLM-5-W8A8', served_model_name=None, tokenizer=None, num_prompts=1000, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=90000, random_output_len=2000, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file='reports/benchmark/inspur_MetaX_C550/GLM-5-W8A8/test_03/01/32-1000-i90000-o2000/bench-test_03-32-1000-i90000-o2000.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None, rampup_mode=False, ramp_up_period=0.0)

#Input tokens: 90000000
#Output tokens: 2000000
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

  0%|          | 0/1000 [00:00<?, ?it/s]
  0%|          | 1/1000 [00:05<1:24:32,  5.08s/it]
  0%|          | 4/1000 [00:05<16:41,  1.01s/it]  
  1%|          | 6/1000 [00:05<11:12,  1.48it/s]
  1%|          | 9/1000 [00:05<06:12,  2.66it/s]
  1%|          | 11/1000 [00:06<05:29,  3.00it/s]
  1%|          | 12/1000 [00:06<05:25,  3.03it/s]
  1%|▏         | 13/1000 [00:06<04:49,  3.41it/s]
  1%|▏         | 14/1000 [00:07<04:18,  3.81it/s]
  2%|▏         | 17/1000 [00:07<02:34,  6.34it/s]
  2%|▏         | 19/1000 [00:07<03:01,  5.42it/s]
  2%|▏         | 20/1000 [00:07<03:25,  4.77it/s]
  2%|▏         | 21/1000 [00:08<03:12,  5.08it/s]
  2%|▏         | 22/1000 [00:08<02:59,  5.43it/s]
  2%|▏         | 23/1000 [00:08<02:54,  5.60it/s]
  3%|▎         | 26/1000 [00:08<01:50,  8.79it/s]
  3%|▎         | 28/1000 [00:09<02:36,  6.22it/s]
  3%|▎         | 29/1000 [00:09<03:26,  4.71it/s]
  3%|▎         | 32/1000 [00:09<02:13,  7.24it/s]
  3%|▎         | 34/1000 [00:09<02:20,  6.89it/s]
  4%|▎         | 36/1000 [00:10<02:27,  6.53it/s]
  4%|▍         | 38/1000 [00:10<03:09,  5.07it/s]
  4%|▍         | 42/1000 [00:11<01:59,  7.99it/s]
  4%|▍         | 44/1000 [00:11<02:50,  5.62it/s]
  5%|▍         | 46/1000 [00:11<02:28,  6.43it/s]
  5%|▍         | 47/1000 [00:12<02:26,  6.51it/s]
  5%|▍         | 48/1000 [00:12<02:59,  5.30it/s]
  5%|▍         | 49/1000 [00:12<02:56,  5.40it/s]
  5%|▌         | 52/1000 [00:12<02:01,  7.78it/s]
  5%|▌         | 53/1000 [00:13<02:15,  6.98it/s]
  5%|▌         | 54/1000 [00:13<02:23,  6.61it/s]
  6%|▌         | 55/1000 [00:13<04:15,  3.70it/s]
  6%|▌         | 58/1000 [00:14<02:32,  6.18it/s]
  6%|▌         | 60/1000 [00:14<02:34,  6.07it/s]
  6%|▌         | 62/1000 [00:14<02:30,  6.22it/s]
  6%|▋         | 64/1000 [00:15<03:17,  4.74it/s]
  7%|▋         | 67/1000 [00:15<02:19,  6.68it/s]
  7%|▋         | 69/1000 [00:15<02:06,  7.37it/s]
  7%|▋         | 70/1000 [00:16<03:06,  4.98it/s]
  7%|▋         | 71/1000 [00:16<03:02,  5.10it/s]
  7%|▋         | 72/1000 [00:16<02:55,  5.27it/s]
  7%|▋         | 73/1000 [00:16<02:48,  5.50it/s]
  7%|▋         | 74/1000 [00:16<02:44,  5.63it/s]
  8%|▊         | 76/1000 [00:17<02:06,  7.30it/s]
  8%|▊         | 77/1000 [00:17<02:11,  7.01it/s]
  8%|▊         | 78/1000 [00:17<02:09,  7.14it/s]
  8%|▊         | 79/1000 [00:17<02:53,  5.30it/s]
  8%|▊         | 80/1000 [00:17<03:27,  4.44it/s]
  8%|▊         | 83/1000 [00:18<02:02,  7.51it/s]
  8%|▊         | 84/1000 [00:18<02:42,  5.64it/s]
  9%|▊         | 86/1000 [00:18<02:10,  7.02it/s]
  9%|▉         | 89/1000 [00:19<01:57,  7.76it/s]
  9%|▉         | 90/1000 [00:19<02:41,  5.64it/s]
  9%|▉         | 91/1000 [00:19<02:38,  5.73it/s]
  9%|▉         | 92/1000 [00:19<02:33,  5.90it/s]
  9%|▉         | 94/1000 [00:20<02:29,  6.06it/s]
 10%|▉         | 95/1000 [00:20<02:33,  5.88it/s]
 10%|▉         | 96/1000 [00:20<02:29,  6.04it/s]
 10%|▉         | 98/1000 [00:20<01:54,  7.85it/s]
 10%|█         | 100/1000 [00:20<02:02,  7.34it/s]
 10%|█         | 101/1000 [00:21<02:38,  5.67it/s]
 10%|█         | 102/1000 [00:21<02:29,  6.01it/s]
 10%|█         | 103/1000 [00:21<02:24,  6.22it/s]
 11%|█         | 106/1000 [00:21<01:34,  9.48it/s]
 11%|█         | 108/1000 [00:22<02:37,  5.66it/s]
 11%|█         | 109/1000 [00:22<02:36,  5.68it/s]
 11%|█         | 110/1000 [00:22<02:31,  5.89it/s]
 11%|█         | 112/1000 [00:23<02:50,  5.21it/s]
 12%|█▏        | 115/1000 [00:23<01:50,  7.98it/s]
 12%|█▏        | 118/1000 [00:23<02:42,  5.43it/s]
 13%|█▎        | 126/1000 [00:24<01:47,  8.15it/s]
 13%|█▎        | 128/1000 [00:25<02:43,  5.34it/s]
 13%|█▎        | 132/1000 [00:25<01:58,  7.35it/s]
 13%|█▎        | 134/1000 [00:26<02:32,  5.69it/s]
 14%|█▎        | 136/1000 [00:26<02:29,  5.79it/s]
 14%|█▍        | 139/1000 [00:26<01:56,  7.39it/s]
 14%|█▍        | 141/1000 [00:27<02:24,  5.93it/s]
 14%|█▍        | 143/1000 [00:27<02:22,  6.00it/s]
 14%|█▍        | 144/1000 [00:27<02:23,  5.96it/s]
 15%|█▍        | 146/1000 [00:28<02:00,  7.11it/s]
 15%|█▍        | 147/1000 [00:28<02:03,  6.92it/s]
 15%|█▍        | 148/1000 [00:28<02:08,  6.62it/s]
 15%|█▍        | 149/1000 [00:28<02:38,  5.37it/s]
 15%|█▌        | 150/1000 [00:29<03:04,  4.60it/s]
 15%|█▌        | 154/1000 [00:29<01:37,  8.71it/s]
 16%|█▌        | 156/1000 [00:29<01:46,  7.92it/s]
 16%|█▌        | 157/1000 [00:29<01:51,  7.54it/s]
 16%|█▌        | 158/1000 [00:30<02:53,  4.87it/s]
 16%|█▌        | 160/1000 [00:30<02:59,  4.68it/s]
 16%|█▋        | 164/1000 [00:30<01:45,  7.89it/s]
 17%|█▋        | 166/1000 [00:31<02:17,  6.07it/s]
 17%|█▋        | 167/1000 [00:31<02:34,  5.38it/s]
 17%|█▋        | 169/1000 [00:31<02:04,  6.70it/s]
 17%|█▋        | 170/1000 [00:32<02:29,  5.57it/s]
 17%|█▋        | 171/1000 [00:32<02:23,  5.78it/s]
 17%|█▋        | 173/1000 [00:32<01:47,  7.66it/s]
 18%|█▊        | 175/1000 [00:32<01:58,  6.97it/s]
 18%|█▊        | 176/1000 [00:33<02:29,  5.53it/s]
 18%|█▊        | 177/1000 [00:33<02:24,  5.70it/s]
 18%|█▊        | 178/1000 [00:33<02:19,  5.88it/s]
 18%|█▊        | 179/1000 [00:33<02:23,  5.74it/s]
 18%|█▊        | 180/1000 [00:33<02:09,  6.34it/s]
 18%|█▊        | 183/1000 [00:33<01:24,  9.66it/s]
 18%|█▊        | 185/1000 [00:34<02:12,  6.17it/s]
 19%|█▊        | 186/1000 [00:34<02:07,  6.37it/s]
 19%|█▊        | 187/1000 [00:34<02:11,  6.17it/s]
 19%|█▉        | 188/1000 [00:34<02:09,  6.27it/s]
 19%|█▉        | 190/1000 [00:35<01:42,  7.88it/s]
 19%|█▉        | 191/1000 [00:35<01:44,  7.72it/s]
 19%|█▉        | 192/1000 [00:35<01:55,  6.99it/s]
 19%|█▉        | 193/1000 [00:35<02:31,  5.31it/s]
 20%|█▉        | 195/1000 [00:35<02:15,  5.96it/s]
 20%|█▉        | 196/1000 [00:36<02:17,  5.86it/s]
 20%|█▉        | 197/1000 [00:36<02:15,  5.94it/s]
 20%|█▉        | 199/1000 [00:36<01:45,  7.62it/s]
 20%|██        | 201/1000 [00:36<01:57,  6.82it/s]
 20%|██        | 202/1000 [00:36<01:51,  7.17it/s]
 20%|██        | 203/1000 [00:37<02:45,  4.82it/s]
 20%|██        | 205/1000 [00:37<02:03,  6.46it/s]
 21%|██        | 206/1000 [00:37<02:08,  6.20it/s]
 21%|██        | 207/1000 [00:37<02:06,  6.29it/s]
 21%|██        | 208/1000 [00:37<02:03,  6.43it/s]
 21%|██        | 210/1000 [00:38<01:37,  8.14it/s]
 21%|██        | 212/1000 [00:38<01:47,  7.35it/s]
 21%|██▏       | 213/1000 [00:38<01:52,  7.01it/s]
 22%|██▏       | 215/1000 [00:38<01:59,  6.56it/s]
 22%|██▏       | 216/1000 [00:39<02:22,  5.50it/s]
 22%|██▏       | 217/1000 [00:39<02:14,  5.83it/s]
 22%|██▏       | 218/1000 [00:39<02:10,  6.00it/s]
 22%|██▏       | 220/1000 [00:39<01:38,  7.93it/s]
 22%|██▏       | 222/1000 [00:39<01:42,  7.57it/s]
 22%|██▏       | 224/1000 [00:40<01:54,  6.77it/s]
 23%|██▎       | 226/1000 [00:40<02:13,  5.78it/s]
 23%|██▎       | 227/1000 [00:40<02:06,  6.12it/s]
 23%|██▎       | 228/1000 [00:41<02:01,  6.33it/s]
 23%|██▎       | 229/1000 [00:41<01:58,  6.53it/s]
 23%|██▎       | 230/1000 [00:41<02:01,  6.33it/s]
 23%|██▎       | 232/1000 [00:41<01:27,  8.73it/s]
 24%|██▎       | 235/1000 [00:42<02:12,  5.77it/s]
 24%|██▍       | 239/1000 [00:42<01:25,  8.88it/s]
 24%|██▍       | 241/1000 [00:42<01:19,  9.53it/s]
 24%|██▍       | 243/1000 [00:43<02:05,  6.06it/s]
 24%|██▍       | 244/1000 [00:43<02:03,  6.10it/s]
 24%|██▍       | 245/1000 [00:43<02:24,  5.21it/s]
 25%|██▍       | 247/1000 [00:43<01:56,  6.45it/s]
 25%|██▍       | 248/1000 [00:44<02:21,  5.32it/s]
 25%|██▍       | 249/1000 [00:44<02:13,  5.62it/s]
 25%|██▌       | 252/1000 [00:44<01:26,  8.66it/s]
 25%|██▌       | 254/1000 [00:45<02:13,  5.57it/s]
 26%|██▌       | 257/1000 [00:45<02:00,  6.19it/s]
 26%|██▌       | 258/1000 [00:45<02:00,  6.16it/s]
 26%|██▌       | 260/1000 [00:45<01:42,  7.19it/s]
 26%|██▋       | 263/1000 [00:46<01:44,  7.02it/s]
 26%|██▋       | 264/1000 [00:46<02:02,  6.01it/s]
 26%|██▋       | 265/1000 [00:46<02:01,  6.07it/s]
 27%|██▋       | 266/1000 [00:46<01:58,  6.18it/s]
 27%|██▋       | 267/1000 [00:46<01:58,  6.18it/s]
 27%|██▋       | 270/1000 [00:47<01:17,  9.39it/s]
 27%|██▋       | 272/1000 [00:47<01:53,  6.40it/s]
 27%|██▋       | 273/1000 [00:47<02:16,  5.34it/s]
 28%|██▊       | 275/1000 [00:48<01:49,  6.63it/s]
 28%|██▊       | 276/1000 [00:48<02:32,  4.73it/s]
 28%|██▊       | 280/1000 [00:48<01:28,  8.15it/s]
 28%|██▊       | 282/1000 [00:49<01:37,  7.36it/s]
 28%|██▊       | 283/1000 [00:49<01:38,  7.26it/s]
 28%|██▊       | 284/1000 [00:49<02:40,  4.45it/s]
 29%|██▊       | 287/1000 [00:50<01:45,  6.73it/s]
 29%|██▉       | 289/1000 [00:50<01:30,  7.88it/s]
 29%|██▉       | 291/1000 [00:50<01:37,  7.30it/s]
 29%|██▉       | 292/1000 [00:51<02:33,  4.61it/s]
 30%|██▉       | 296/1000 [00:51<01:30,  7.81it/s]
 30%|██▉       | 298/1000 [00:51<01:52,  6.25it/s]
 30%|██▉       | 299/1000 [00:52<02:11,  5.33it/s]
 30%|███       | 300/1000 [00:52<02:07,  5.50it/s]
 30%|███       | 301/1000 [00:52<02:05,  5.57it/s]
 30%|███       | 302/1000 [00:52<02:02,  5.69it/s]
 30%|███       | 304/1000 [00:52<01:39,  7.02it/s]
 30%|███       | 305/1000 [00:52<01:42,  6.79it/s]
 31%|███       | 306/1000 [00:53<01:44,  6.66it/s]
 31%|███       | 307/1000 [00:53<01:45,  6.58it/s]
 31%|███       | 308/1000 [00:53<01:50,  6.24it/s]
 31%|███       | 309/1000 [00:53<02:26,  4.73it/s]
 31%|███       | 311/1000 [00:54<02:11,  5.23it/s]
 31%|███       | 312/1000 [00:54<02:05,  5.47it/s]
 31%|███▏      | 314/1000 [00:54<01:36,  7.09it/s]
 32%|███▏      | 315/1000 [00:54<01:37,  7.01it/s]
 32%|███▏      | 316/1000 [00:54<01:39,  6.90it/s]
 32%|███▏      | 317/1000 [00:55<02:16,  5.01it/s]
 32%|███▏      | 319/1000 [00:55<01:45,  6.47it/s]
 32%|███▏      | 320/1000 [00:55<01:43,  6.59it/s]
 32%|███▏      | 321/1000 [00:55<01:48,  6.29it/s]
 32%|███▏      | 322/1000 [00:55<02:12,  5.10it/s]
 32%|███▏      | 323/1000 [00:56<02:04,  5.46it/s]
 32%|███▎      | 325/1000 [00:56<01:34,  7.16it/s]
 33%|███▎      | 327/1000 [00:56<02:17,  4.90it/s]
 33%|███▎      | 329/1000 [00:56<01:46,  6.31it/s]
 33%|███▎      | 331/1000 [00:57<01:28,  7.55it/s]
 33%|███▎      | 332/1000 [00:57<01:31,  7.31it/s]
 33%|███▎      | 334/1000 [00:57<02:10,  5.11it/s]
 34%|███▎      | 337/1000 [00:58<01:29,  7.45it/s]
 34%|███▍      | 339/1000 [00:58<01:33,  7.09it/s]
 34%|███▍      | 340/1000 [00:58<01:51,  5.90it/s]
 34%|███▍      | 341/1000 [00:58<01:48,  6.06it/s]
 34%|███▍      | 343/1000 [00:58<01:27,  7.55it/s]
 34%|███▍      | 344/1000 [00:59<01:30,  7.25it/s]
 34%|███▍      | 345/1000 [00:59<01:32,  7.05it/s]
 35%|███▍      | 346/1000 [00:59<02:03,  5.31it/s]
 35%|███▍      | 348/1000 [00:59<01:52,  5.80it/s]
 35%|███▍      | 349/1000 [01:00<01:49,  5.94it/s]
 35%|███▌      | 350/1000 [01:00<01:40,  6.46it/s]
 35%|███▌      | 352/1000 [01:00<01:23,  7.80it/s]
 35%|███▌      | 353/1000 [01:00<01:44,  6.21it/s]
 36%|███▌      | 355/1000 [01:00<01:26,  7.43it/s]
 36%|███▌      | 356/1000 [01:00<01:27,  7.33it/s]
 36%|███▌      | 357/1000 [01:01<01:53,  5.66it/s]
 36%|███▌      | 358/1000 [01:01<01:52,  5.72it/s]
 36%|███▌      | 360/1000 [01:01<01:24,  7.57it/s]
 36%|███▌      | 362/1000 [01:01<01:09,  9.14it/s]
 36%|███▋      | 364/1000 [01:02<01:58,  5.35it/s]
 37%|███▋      | 366/1000 [01:02<01:36,  6.59it/s]
 37%|███▋      | 367/1000 [01:02<01:51,  5.66it/s]
 37%|███▋      | 369/1000 [01:02<01:28,  7.17it/s]
 37%|███▋      | 372/1000 [01:03<01:15,  8.28it/s]
 37%|███▋      | 373/1000 [01:03<02:01,  5.17it/s]
 37%|███▋      | 374/1000 [01:04<02:00,  5.18it/s]
 38%|███▊      | 375/1000 [01:04<01:54,  5.47it/s]
 38%|███▊      | 376/1000 [01:04<01:47,  5.80it/s]
 38%|███▊      | 379/1000 [01:04<01:08,  9.04it/s]
 38%|███▊      | 381/1000 [01:04<01:34,  6.53it/s]
 38%|███▊      | 382/1000 [01:05<01:54,  5.38it/s]
 38%|███▊      | 383/1000 [01:05<01:51,  5.55it/s]
 38%|███▊      | 385/1000 [01:05<01:26,  7.13it/s]
 39%|███▊      | 387/1000 [01:05<01:14,  8.23it/s]
 39%|███▉      | 388/1000 [01:06<01:52,  5.43it/s]
 39%|███▉      | 389/1000 [01:06<01:43,  5.91it/s]
 39%|███▉      | 390/1000 [01:06<01:39,  6.12it/s]
 39%|███▉      | 391/1000 [01:06<01:36,  6.32it/s]
 39%|███▉      | 393/1000 [01:07<01:59,  5.08it/s]
 40%|███▉      | 396/1000 [01:07<01:17,  7.80it/s]
 40%|███▉      | 399/1000 [01:07<01:16,  7.86it/s]
 40%|████      | 400/1000 [01:08<01:50,  5.45it/s]
 40%|████      | 401/1000 [01:08<01:45,  5.68it/s]
 40%|████      | 402/1000 [01:08<01:42,  5.81it/s]
 40%|████      | 404/1000 [01:08<02:00,  4.93it/s]
 41%|████      | 407/1000 [01:09<01:22,  7.22it/s]
 41%|████      | 408/1000 [01:09<01:23,  7.05it/s]
 41%|████      | 410/1000 [01:09<01:28,  6.68it/s]
 41%|████      | 411/1000 [01:09<01:41,  5.83it/s]
 41%|████      | 412/1000 [01:09<01:38,  6.00it/s]
 41%|████▏     | 413/1000 [01:10<01:36,  6.11it/s]
 42%|████▏     | 415/1000 [01:10<01:18,  7.45it/s]
 42%|████▏     | 417/1000 [01:10<01:05,  8.88it/s]
 42%|████▏     | 418/1000 [01:10<01:14,  7.85it/s]
 42%|████▏     | 419/1000 [01:11<02:01,  4.77it/s]
 42%|████▏     | 420/1000 [01:11<01:53,  5.10it/s]
 42%|████▏     | 421/1000 [01:11<01:44,  5.54it/s]
 42%|████▏     | 423/1000 [01:11<01:19,  7.28it/s]
 42%|████▎     | 425/1000 [01:11<01:22,  6.96it/s]
 43%|████▎     | 426/1000 [01:12<01:37,  5.89it/s]
 43%|████▎     | 427/1000 [01:12<01:38,  5.79it/s]
 43%|████▎     | 428/1000 [01:12<01:35,  6.00it/s]
 43%|████▎     | 430/1000 [01:12<01:15,  7.51it/s]
 43%|████▎     | 432/1000 [01:12<01:02,  9.13it/s]
 43%|████▎     | 433/1000 [01:13<02:04,  4.57it/s]
 44%|████▎     | 437/1000 [01:13<01:10,  8.00it/s]
 44%|████▍     | 440/1000 [01:14<01:53,  4.95it/s]
 45%|████▍     | 448/1000 [01:14<01:00,  9.17it/s]
 45%|████▌     | 450/1000 [01:16<01:45,  5.20it/s]
 45%|████▌     | 453/1000 [01:16<01:24,  6.47it/s]
 46%|████▌     | 456/1000 [01:16<01:16,  7.14it/s]
 46%|████▌     | 458/1000 [01:17<01:25,  6.36it/s]
 46%|████▌     | 459/1000 [01:17<01:45,  5.11it/s]
 46%|████▋     | 463/1000 [01:17<01:13,  7.34it/s]
 46%|████▋     | 465/1000 [01:18<01:15,  7.09it/s]
 47%|████▋     | 467/1000 [01:18<01:40,  5.28it/s]
 47%|████▋     | 469/1000 [01:18<01:25,  6.18it/s]
 47%|████▋     | 471/1000 [01:19<01:14,  7.06it/s]
 47%|████▋     | 473/1000 [01:19<01:06,  7.96it/s]
 48%|████▊     | 475/1000 [01:19<01:38,  5.33it/s]
 48%|████▊     | 477/1000 [01:20<01:32,  5.67it/s]
 48%|████▊     | 478/1000 [01:20<01:30,  5.80it/s]
 48%|████▊     | 479/1000 [01:20<01:28,  5.91it/s]
 48%|████▊     | 482/1000 [01:20<01:12,  7.14it/s]
 48%|████▊     | 484/1000 [01:21<01:29,  5.74it/s]
 48%|████▊     | 485/1000 [01:21<01:29,  5.72it/s]
 49%|████▊     | 486/1000 [01:21<01:28,  5.82it/s]
 49%|████▉     | 488/1000 [01:21<01:08,  7.48it/s]
 49%|████▉     | 490/1000 [01:22<01:12,  7.01it/s]
 49%|████▉     | 491/1000 [01:22<01:12,  7.07it/s]
 49%|████▉     | 492/1000 [01:22<01:30,  5.62it/s]
 49%|████▉     | 493/1000 [01:22<01:31,  5.55it/s]
 49%|████▉     | 494/1000 [01:22<01:30,  5.59it/s]
 50%|████▉     | 497/1000 [01:23<00:59,  8.45it/s]
 50%|████▉     | 498/1000 [01:23<01:15,  6.67it/s]
 50%|████▉     | 499/1000 [01:23<01:17,  6.46it/s]
 50%|█████     | 500/1000 [01:23<01:36,  5.17it/s]
 50%|█████     | 501/1000 [01:24<01:36,  5.16it/s]
 50%|█████     | 502/1000 [01:24<01:31,  5.44it/s]
 50%|█████     | 504/1000 [01:24<01:08,  7.22it/s]
 51%|█████     | 506/1000 [01:24<01:14,  6.59it/s]
 51%|█████     | 507/1000 [01:25<01:33,  5.26it/s]
 51%|█████     | 509/1000 [01:25<01:41,  4.86it/s]
 51%|█████▏    | 513/1000 [01:25<00:58,  8.36it/s]
 52%|█████▏    | 515/1000 [01:25<00:52,  9.18it/s]
 52%|█████▏    | 517/1000 [01:26<01:23,  5.81it/s]
 52%|█████▏    | 518/1000 [01:27<01:49,  4.41it/s]
 52%|█████▏    | 521/1000 [01:27<01:16,  6.27it/s]
 52%|█████▏    | 522/1000 [01:27<01:26,  5.53it/s]
 52%|█████▏    | 524/1000 [01:27<01:12,  6.58it/s]
 53%|█████▎    | 527/1000 [01:28<01:13,  6.43it/s]
 53%|█████▎    | 528/1000 [01:28<01:14,  6.33it/s]
 53%|█████▎    | 529/1000 [01:28<01:41,  4.65it/s]
 53%|█████▎    | 533/1000 [01:29<00:59,  7.81it/s]
 54%|█████▎    | 535/1000 [01:29<01:05,  7.05it/s]
 54%|█████▎    | 536/1000 [01:29<01:39,  4.68it/s]
 54%|█████▍    | 541/1000 [01:30<01:00,  7.61it/s]
 54%|█████▍    | 542/1000 [01:30<01:20,  5.69it/s]
 54%|█████▍    | 543/1000 [01:30<01:17,  5.91it/s]
 55%|█████▍    | 546/1000 [01:31<00:55,  8.18it/s]
 55%|█████▍    | 548/1000 [01:31<01:05,  6.87it/s]
 55%|█████▍    | 549/1000 [01:31<01:18,  5.74it/s]
 55%|█████▌    | 550/1000 [01:31<01:19,  5.63it/s]
 55%|█████▌    | 551/1000 [01:32<01:17,  5.82it/s]
 55%|█████▌    | 553/1000 [01:32<01:00,  7.39it/s]
 55%|█████▌    | 554/1000 [01:32<01:00,  7.38it/s]
 56%|█████▌    | 555/1000 [01:32<01:02,  7.11it/s]
 56%|█████▌    | 556/1000 [01:32<01:24,  5.28it/s]
 56%|█████▌    | 558/1000 [01:33<01:17,  5.71it/s]
 56%|█████▌    | 560/1000 [01:33<01:13,  6.00it/s]
 56%|█████▌    | 561/1000 [01:33<01:14,  5.89it/s]
 56%|█████▌    | 562/1000 [01:33<01:14,  5.88it/s]
 56%|█████▋    | 563/1000 [01:33<01:12,  6.06it/s]
 57%|█████▋    | 566/1000 [01:34<00:48,  8.90it/s]
 57%|█████▋    | 567/1000 [01:34<01:05,  6.63it/s]
 57%|█████▋    | 568/1000 [01:34<01:07,  6.41it/s]
 57%|█████▋    | 569/1000 [01:34<01:22,  5.22it/s]
 57%|█████▋    | 570/1000 [01:35<01:18,  5.46it/s]
 57%|█████▋    | 572/1000 [01:35<01:00,  7.08it/s]
 57%|█████▋    | 573/1000 [01:35<01:02,  6.86it/s]
 57%|█████▋    | 574/1000 [01:35<01:06,  6.40it/s]
 57%|█████▊    | 575/1000 [01:35<01:25,  5.00it/s]
 58%|█████▊    | 577/1000 [01:36<01:04,  6.53it/s]
 58%|█████▊    | 578/1000 [01:36<01:22,  5.13it/s]
 58%|█████▊    | 579/1000 [01:36<01:17,  5.43it/s]
 58%|█████▊    | 582/1000 [01:36<00:48,  8.64it/s]
 58%|█████▊    | 584/1000 [01:37<01:04,  6.49it/s]
 58%|█████▊    | 585/1000 [01:37<01:15,  5.49it/s]
 59%|█████▊    | 586/1000 [01:37<01:12,  5.67it/s]
 59%|█████▊    | 587/1000 [01:37<01:10,  5.84it/s]
 59%|█████▉    | 588/1000 [01:37<01:07,  6.07it/s]
 59%|█████▉    | 591/1000 [01:38<00:43,  9.51it/s]
 59%|█████▉    | 593/1000 [01:38<00:58,  7.01it/s]
 59%|█████▉    | 594/1000 [01:39<01:25,  4.77it/s]
 60%|██████    | 600/1000 [01:39<00:38, 10.43it/s]
 60%|██████    | 602/1000 [01:39<01:03,  6.30it/s]
 60%|██████    | 604/1000 [01:40<01:04,  6.17it/s]
 61%|██████    | 606/1000 [01:40<01:11,  5.49it/s]
 61%|██████    | 607/1000 [01:40<01:10,  5.61it/s]
 61%|██████    | 609/1000 [01:41<00:56,  6.90it/s]
 61%|██████    | 611/1000 [01:41<00:49,  7.80it/s]
 61%|██████▏   | 613/1000 [01:41<01:10,  5.47it/s]
 62%|██████▏   | 617/1000 [01:42<00:49,  7.80it/s]
 62%|██████▏   | 619/1000 [01:42<00:59,  6.43it/s]
 62%|██████▏   | 620/1000 [01:42<01:08,  5.52it/s]
 62%|██████▏   | 622/1000 [01:43<01:07,  5.64it/s]
 62%|██████▏   | 623/1000 [01:43<01:05,  5.73it/s]
 62%|██████▏   | 624/1000 [01:43<01:04,  5.83it/s]
 62%|██████▎   | 625/1000 [01:43<01:04,  5.85it/s]
 63%|██████▎   | 626/1000 [01:43<01:03,  5.90it/s]
 63%|██████▎   | 628/1000 [01:44<00:50,  7.32it/s]
 63%|██████▎   | 629/1000 [01:44<00:52,  7.04it/s]
 63%|██████▎   | 630/1000 [01:44<00:53,  6.93it/s]
 63%|██████▎   | 631/1000 [01:44<01:12,  5.12it/s]
 63%|██████▎   | 633/1000 [01:45<01:03,  5.76it/s]
 63%|██████▎   | 634/1000 [01:45<01:02,  5.88it/s]
 64%|██████▎   | 636/1000 [01:45<00:49,  7.36it/s]
 64%|██████▎   | 637/1000 [01:45<00:52,  6.95it/s]
 64%|██████▍   | 638/1000 [01:45<00:51,  7.07it/s]
 64%|██████▍   | 639/1000 [01:46<01:06,  5.42it/s]
 64%|██████▍   | 641/1000 [01:46<00:52,  6.83it/s]
 64%|██████▍   | 642/1000 [01:46<01:20,  4.44it/s]
 65%|██████▍   | 646/1000 [01:46<00:43,  8.12it/s]
 65%|██████▍   | 648/1000 [01:47<00:52,  6.69it/s]
 65%|██████▍   | 649/1000 [01:47<01:01,  5.71it/s]
 65%|██████▌   | 650/1000 [01:47<01:01,  5.70it/s]
 65%|██████▌   | 653/1000 [01:47<00:42,  8.24it/s]
 65%|██████▌   | 654/1000 [01:48<01:05,  5.24it/s]
 66%|██████▌   | 656/1000 [01:48<01:02,  5.52it/s]
 66%|██████▌   | 657/1000 [01:49<01:13,  4.67it/s]
 66%|██████▌   | 661/1000 [01:49<00:42,  7.95it/s]
 66%|██████▋   | 663/1000 [01:49<01:01,  5.50it/s]
 66%|██████▋   | 665/1000 [01:50<01:00,  5.52it/s]
 67%|██████▋   | 669/1000 [01:50<00:38,  8.56it/s]
 67%|██████▋   | 671/1000 [01:51<00:55,  5.97it/s]
 67%|██████▋   | 673/1000 [01:51<00:48,  6.76it/s]
 68%|██████▊   | 675/1000 [01:51<00:47,  6.79it/s]
 68%|██████▊   | 676/1000 [01:51<00:55,  5.82it/s]
 68%|██████▊   | 678/1000 [01:52<00:52,  6.12it/s]
 68%|██████▊   | 679/1000 [01:52<00:53,  5.96it/s]
 68%|██████▊   | 681/1000 [01:52<01:01,  5.20it/s]
 68%|██████▊   | 685/1000 [01:53<00:36,  8.53it/s]
 69%|██████▊   | 687/1000 [01:53<00:55,  5.68it/s]
 69%|██████▉   | 689/1000 [01:54<00:54,  5.75it/s]
 69%|██████▉   | 690/1000 [01:54<00:52,  5.87it/s]
 69%|██████▉   | 691/1000 [01:54<00:52,  5.90it/s]
 69%|██████▉   | 693/1000 [01:54<00:41,  7.37it/s]
 70%|██████▉   | 695/1000 [01:54<00:35,  8.64it/s]
 70%|██████▉   | 697/1000 [01:55<00:56,  5.38it/s]
 70%|██████▉   | 698/1000 [01:55<01:04,  4.65it/s]
 70%|███████   | 703/1000 [01:56<00:39,  7.47it/s]
 70%|███████   | 704/1000 [01:56<00:51,  5.71it/s]
 71%|███████   | 706/1000 [01:56<00:49,  5.96it/s]
 71%|███████   | 707/1000 [01:56<00:48,  6.01it/s]
 71%|███████   | 709/1000 [01:57<00:41,  6.93it/s]
 71%|███████   | 711/1000 [01:57<00:35,  8.09it/s]
 71%|███████   | 712/1000 [01:57<01:03,  4.53it/s]
 72%|███████▏  | 717/1000 [01:58<00:33,  8.54it/s]
 72%|███████▏  | 719/1000 [01:58<00:49,  5.65it/s]
 72%|███████▏  | 721/1000 [01:59<00:54,  5.10it/s]
 72%|███████▎  | 725/1000 [01:59<00:35,  7.71it/s]
 73%|███████▎  | 728/1000 [02:00<00:38,  7.01it/s]
 73%|███████▎  | 730/1000 [02:00<00:49,  5.46it/s]
 73%|███████▎  | 731/1000 [02:00<00:48,  5.54it/s]
 73%|███████▎  | 732/1000 [02:00<00:46,  5.72it/s]
 73%|███████▎  | 733/1000 [02:01<00:46,  5.79it/s]
 74%|███████▎  | 736/1000 [02:01<00:31,  8.28it/s]
 74%|███████▍  | 738/1000 [02:01<00:37,  7.00it/s]
 74%|███████▍  | 739/1000 [02:02<00:50,  5.17it/s]
 74%|███████▍  | 743/1000 [02:02<00:29,  8.60it/s]
 74%|███████▍  | 745/1000 [02:02<00:33,  7.64it/s]
 75%|███████▍  | 747/1000 [02:03<00:46,  5.44it/s]
 75%|███████▌  | 753/1000 [02:03<00:27,  8.86it/s]
 76%|███████▌  | 755/1000 [02:04<00:49,  4.96it/s]
 76%|███████▌  | 760/1000 [02:04<00:30,  7.74it/s]
 76%|███████▌  | 762/1000 [02:05<00:38,  6.11it/s]
 76%|███████▋  | 764/1000 [02:05<00:42,  5.58it/s]
 77%|███████▋  | 767/1000 [02:06<00:32,  7.11it/s]
 77%|███████▋  | 769/1000 [02:06<00:41,  5.57it/s]
 77%|███████▋  | 771/1000 [02:06<00:36,  6.35it/s]
 77%|███████▋  | 772/1000 [02:07<00:41,  5.43it/s]
 77%|███████▋  | 773/1000 [02:07<00:40,  5.63it/s]
 78%|███████▊  | 775/1000 [02:07<00:32,  6.93it/s]
 78%|███████▊  | 776/1000 [02:07<00:39,  5.70it/s]
 78%|███████▊  | 777/1000 [02:07<00:37,  5.90it/s]
 78%|███████▊  | 779/1000 [02:08<00:29,  7.53it/s]
 78%|███████▊  | 780/1000 [02:08<00:30,  7.20it/s]
 78%|███████▊  | 781/1000 [02:08<00:31,  6.86it/s]
 78%|███████▊  | 782/1000 [02:08<00:40,  5.37it/s]
 78%|███████▊  | 783/1000 [02:08<00:40,  5.40it/s]
 78%|███████▊  | 785/1000 [02:09<00:31,  6.92it/s]
 79%|███████▊  | 786/1000 [02:09<00:31,  6.81it/s]
 79%|███████▊  | 787/1000 [02:09<00:29,  7.28it/s]
 79%|███████▉  | 788/1000 [02:09<00:38,  5.55it/s]
 79%|███████▉  | 790/1000 [02:09<00:28,  7.47it/s]
 79%|███████▉  | 792/1000 [02:10<00:29,  6.97it/s]
 79%|███████▉  | 793/1000 [02:10<00:39,  5.26it/s]
 79%|███████▉  | 794/1000 [02:10<00:37,  5.54it/s]
 80%|███████▉  | 795/1000 [02:10<00:34,  5.91it/s]
 80%|███████▉  | 797/1000 [02:10<00:26,  7.60it/s]
 80%|███████▉  | 798/1000 [02:11<00:33,  5.95it/s]
 80%|███████▉  | 799/1000 [02:11<00:33,  6.04it/s]
 80%|████████  | 801/1000 [02:11<00:25,  7.96it/s]
 80%|████████  | 802/1000 [02:11<00:34,  5.69it/s]
 80%|████████  | 804/1000 [02:12<00:28,  6.95it/s]
 81%|████████  | 806/1000 [02:12<00:28,  6.77it/s]
 81%|████████  | 807/1000 [02:12<00:29,  6.53it/s]
 81%|████████  | 808/1000 [02:13<00:42,  4.47it/s]
 81%|████████  | 811/1000 [02:13<00:25,  7.29it/s]
 81%|████████▏ | 814/1000 [02:13<00:24,  7.63it/s]
 82%|████████▏ | 815/1000 [02:14<00:35,  5.26it/s]
 82%|████████▏ | 816/1000 [02:14<00:33,  5.43it/s]
 82%|████████▏ | 817/1000 [02:14<00:32,  5.59it/s]
 82%|████████▏ | 819/1000 [02:14<00:25,  7.00it/s]
 82%|████████▏ | 820/1000 [02:14<00:26,  6.83it/s]
 82%|████████▏ | 821/1000 [02:14<00:27,  6.41it/s]
 82%|████████▏ | 822/1000 [02:15<00:36,  4.88it/s]
 82%|████████▏ | 824/1000 [02:15<00:38,  4.63it/s]
 83%|████████▎ | 828/1000 [02:15<00:24,  7.11it/s]
 83%|████████▎ | 830/1000 [02:16<00:25,  6.65it/s]
 83%|████████▎ | 832/1000 [02:16<00:32,  5.18it/s]
 84%|████████▎ | 835/1000 [02:17<00:23,  7.16it/s]
 84%|████████▎ | 837/1000 [02:17<00:20,  8.06it/s]
 84%|████████▍ | 839/1000 [02:17<00:27,  5.75it/s]
 84%|████████▍ | 841/1000 [02:18<00:31,  5.12it/s]
 84%|████████▍ | 843/1000 [02:18<00:25,  6.07it/s]
 84%|████████▍ | 845/1000 [02:18<00:21,  7.12it/s]
 85%|████████▍ | 846/1000 [02:18<00:22,  6.97it/s]
 85%|████████▍ | 848/1000 [02:19<00:23,  6.43it/s]
 85%|████████▌ | 850/1000 [02:19<00:30,  4.85it/s]
 85%|████████▌ | 852/1000 [02:19<00:24,  6.06it/s]
 85%|████████▌ | 854/1000 [02:20<00:19,  7.42it/s]
 86%|████████▌ | 857/1000 [02:20<00:20,  6.85it/s]
 86%|████████▌ | 859/1000 [02:21<00:27,  5.20it/s]
 86%|████████▋ | 863/1000 [02:21<00:17,  7.87it/s]
 86%|████████▋ | 865/1000 [02:21<00:20,  6.52it/s]
 87%|████████▋ | 866/1000 [02:22<00:20,  6.65it/s]
 87%|████████▋ | 867/1000 [02:22<00:19,  6.76it/s]
 87%|████████▋ | 868/1000 [02:22<00:20,  6.50it/s]
 87%|████████▋ | 869/1000 [02:22<00:25,  5.23it/s]
 87%|████████▋ | 870/1000 [02:22<00:25,  5.19it/s]
 87%|████████▋ | 871/1000 [02:23<00:23,  5.46it/s]
 87%|████████▋ | 873/1000 [02:23<00:17,  7.24it/s]
 88%|████████▊ | 875/1000 [02:23<00:18,  6.74it/s]
 88%|████████▊ | 876/1000 [02:23<00:22,  5.51it/s]
 88%|████████▊ | 877/1000 [02:24<00:26,  4.66it/s]
 88%|████████▊ | 882/1000 [02:24<00:12,  9.71it/s]
 88%|████████▊ | 884/1000 [02:24<00:18,  6.24it/s]
 88%|████████▊ | 885/1000 [02:25<00:18,  6.27it/s]
 89%|████████▊ | 886/1000 [02:25<00:20,  5.46it/s]
 89%|████████▊ | 887/1000 [02:25<00:19,  5.89it/s]
 89%|████████▉ | 890/1000 [02:25<00:12,  8.69it/s]
 89%|████████▉ | 892/1000 [02:26<00:17,  6.19it/s]
 89%|████████▉ | 893/1000 [02:26<00:17,  6.14it/s]
 89%|████████▉ | 894/1000 [02:26<00:17,  6.02it/s]
 90%|████████▉ | 895/1000 [02:26<00:17,  5.97it/s]
 90%|████████▉ | 897/1000 [02:26<00:13,  7.46it/s]
 90%|████████▉ | 899/1000 [02:27<00:18,  5.40it/s]
 90%|█████████ | 900/1000 [02:27<00:18,  5.53it/s]
 90%|█████████ | 901/1000 [02:27<00:17,  5.66it/s]
 90%|█████████ | 902/1000 [02:27<00:16,  5.79it/s]
 90%|█████████ | 904/1000 [02:28<00:12,  7.44it/s]
 91%|█████████ | 906/1000 [02:28<00:13,  6.76it/s]
 91%|█████████ | 908/1000 [02:29<00:19,  4.73it/s]
 91%|█████████ | 912/1000 [02:29<00:11,  7.89it/s]
 91%|█████████▏| 914/1000 [02:29<00:15,  5.72it/s]
 92%|█████████▏| 917/1000 [02:30<00:11,  7.46it/s]
 92%|█████████▏| 919/1000 [02:30<00:11,  6.94it/s]
 92%|█████████▏| 920/1000 [02:30<00:15,  5.25it/s]
 92%|█████████▏| 921/1000 [02:31<00:14,  5.28it/s]
 92%|█████████▏| 922/1000 [02:31<00:14,  5.34it/s]
 92%|█████████▏| 923/1000 [02:31<00:13,  5.77it/s]
 92%|█████████▏| 924/1000 [02:31<00:12,  6.16it/s]
 92%|█████████▎| 925/1000 [02:31<00:12,  6.14it/s]
 93%|█████████▎| 926/1000 [02:31<00:11,  6.42it/s]
 93%|█████████▎| 928/1000 [02:31<00:08,  8.09it/s]
 93%|█████████▎| 929/1000 [02:32<00:09,  7.60it/s]
 93%|█████████▎| 931/1000 [02:32<00:10,  6.64it/s]
 93%|█████████▎| 932/1000 [02:32<00:15,  4.42it/s]
 94%|█████████▎| 936/1000 [02:33<00:07,  8.18it/s]
 94%|█████████▍| 938/1000 [02:33<00:09,  6.45it/s]
 94%|█████████▍| 939/1000 [02:34<00:13,  4.60it/s]
 94%|█████████▍| 942/1000 [02:34<00:08,  6.69it/s]
 94%|█████████▍| 944/1000 [02:34<00:07,  7.80it/s]
 95%|█████████▍| 946/1000 [02:34<00:08,  6.18it/s]
 95%|█████████▍| 947/1000 [02:35<00:08,  6.17it/s]
 95%|█████████▍| 949/1000 [02:35<00:09,  5.53it/s]
 95%|█████████▌| 950/1000 [02:35<00:08,  5.59it/s]
 95%|█████████▌| 951/1000 [02:35<00:08,  5.64it/s]
 95%|█████████▌| 952/1000 [02:36<00:08,  5.63it/s]
 95%|█████████▌| 953/1000 [02:36<00:08,  5.73it/s]
 95%|█████████▌| 954/1000 [02:36<00:07,  5.78it/s]
 96%|█████████▌| 956/1000 [02:36<00:05,  7.54it/s]
 96%|█████████▌| 958/1000 [02:36<00:06,  6.84it/s]
 96%|█████████▌| 960/1000 [02:37<00:08,  4.77it/s]
 96%|█████████▋| 963/1000 [02:37<00:06,  5.90it/s]
 96%|█████████▋| 965/1000 [02:38<00:05,  6.08it/s]
 97%|█████████▋| 966/1000 [02:38<00:05,  6.17it/s]
 97%|█████████▋| 968/1000 [02:38<00:04,  7.27it/s]
 97%|█████████▋| 969/1000 [02:38<00:05,  5.61it/s]
 97%|█████████▋| 971/1000 [02:38<00:04,  7.00it/s]
100%|█████████▉| 998/1000 [02:39<00:00, 35.67it/s]
100%|██████████| 1000/1000 [02:39<00:00,  6.27it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 32        
Successful requests:                     1000      
Benchmark duration (s):                  159.61    
Total input tokens:                      90000000  
Total input text tokens:                 90000000  
Total generated tokens:                  1000      
Total generated tokens (retokenized):    1000      
Request throughput (req/s):              6.27      
Input token throughput (tok/s):          563881.95 
Output token throughput (tok/s):         6.27      
Peak output token throughput (tok/s):    22.00     
Peak concurrent requests:                46        
Total token throughput (tok/s):          563888.21 
Concurrency:                             31.88     
Accept length:                           3.87      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   5088.28   
Median E2E Latency (ms):                 5093.21   
P90 E2E Latency (ms):                    5501.08   
P99 E2E Latency (ms):                    8234.16   
---------------Time to First Token----------------
Mean TTFT (ms):                          5088.27   
Median TTFT (ms):                        5093.20   
P99 TTFT (ms):                           8234.15   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          0.00      
Median TPOT (ms):                        0.00      
P99 TPOT (ms):                           0.00      
---------------Inter-Token Latency----------------
Mean ITL (ms):                           0.00      
Median ITL (ms):                         0.00      
P95 ITL (ms):                            0.00      
P99 ITL (ms):                            0.00      
Max ITL (ms):                            0.00      
==================================================